modm-ext/data.modm.io/docs/svd/header_stm32h5e5xx.svd
        <register>
          <name>I2SCFGR</name>
          <description>I2S Configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2SMOD</name>
              <description>I2S mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2SCFG</name>
              <description>I2SCFG[2:0] I2S configuration mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE_TX</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_RX</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE_FULL_DUPLEX</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_TX</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_RX</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_FULL_DUPLEX</name>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2SSTD</name>
              <description>I2SSTD[1:0] I2S standard selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCMSYNC</name>
              <description>PCM frame synchronization</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATLEN</name>
              <description>DATLEN[1:0] Data length to be transferred</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHLEN</name>
              <description>Channel length (number of bits per audio channel)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKPOL</name>
              <description>Steady state clock polarity</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIXCH</name>
              <description>Fixed channel length in SLAVE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VARIABLE_CH_LENGTH</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_CH_LENGTH</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSINV</name>
              <description>Word select inversion</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATFMT</name>
              <description>Data format</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2SDIV</name>
              <description>I2S Linear prescaler</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ODD</name>
              <description>Odd factor for the prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKOE</name>
              <description>Master Clock Output Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40003c00</baseAddress>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global interrupt</description>
        <value>57</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>COMP12</name>
      <description>Comparator</description>
      <groupName>COMPOPT</groupName>
      <baseAddress>0x40004000</baseAddress>
      <interrupt>
        <name>COMP</name>
        <description>COMP1 COMP2 global interrupt</description>
        <value>133</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <description>Comparator status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C1VAL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2VAL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1IF</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2IF</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICFR</name>
          <description>Comparator interrupt clear flag register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CC1IF</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC2IF</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1_ODD</name>
          <description>COMP control and status register located in register of comparator instance odd, used for bits common to several COMP instances</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>COMP1 enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRGEN</name>
              <description>COMP1 Scaler bridge enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCALEN</name>
              <description>COMP1 Voltage scaler enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMP1 polarity selection bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>COMP1 window mode selection bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITEN</name>
              <description>COMP1 interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>COMP1 hysteresis selection bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Hysteresis level low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Hysteresis level medium</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Hysteresis level high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMP1 Power Mode of the comparator</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>COMP power mode to high speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to medium speed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRALOWPOWER</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINOUT</name>
              <description>COMP1 window output selection bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INMSEL</name>
              <description>COMP1 input minus selection bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INPSEL0</name>
              <description>COMP1 input plus 0 selection bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INPSEL1</name>
              <description>COMP1 input plus 1 selection bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANKING</name>
              <description>COMP1 blanking source selection bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5</name>
                  <description>Comparator output blanking source TIM1 OC5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3</name>
                  <description>Comparator output blanking source TIM2 OC3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC4</name>
                  <description>Comparator output blanking source TIM3 OC4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPTIM1_OC2</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPTIM2_OC2</name>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>COMP1 Lock Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1_EVEN</name>
          <description>COMP control and status register located in register of comparator instance even, used for bits common to several COMP instances</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>COMP1 enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRGEN</name>
              <description>COMP1 Scaler bridge enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCALEN</name>
              <description>COMP1 Voltage scaler enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMP1 polarity selection bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>COMP1 window mode selection bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITEN</name>
              <description>COMP1 interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>COMP1 hysteresis selection bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Hysteresis level low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Hysteresis level medium</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Hysteresis level high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMP1 Power Mode of the comparator</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>COMP power mode to high speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to medium speed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRALOWPOWER</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINOUT</name>
              <description>COMP1 window output selection bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INMSEL</name>
              <description>COMP1 input minus selection bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>INPSEL0</name>
              <description>COMP1 input plus 0 selection bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INPSEL1</name>
              <description>COMP1 input plus 1 selection bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLANKING</name>
              <description>COMP1 blanking source selection bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5</name>
                  <description>Comparator output blanking source TIM1 OC5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3</name>
                  <description>Comparator output blanking source TIM2 OC3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC4</name>
                  <description>Comparator output blanking source TIM3 OC4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPTIM1_OC2</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPTIM2_OC2</name>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>COMP1 Lock Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
