modm-ext/data.modm.io/docs/svd/header_stm32h5e5xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 Event interrupt</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 Error interrupt</description>
        <value>54</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>I3C1</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <groupName>I3C</groupName>
      <baseAddress>0x40005c00</baseAddress>
      <interrupt>
        <name>I3C1_EV</name>
        <description>I3C1 event interrupt</description>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>I3C1_ER</name>
        <description>I3C1 error interrupt</description>
        <value>124</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>I3C Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCNT</name>
              <description>Data Byte Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RNW</name>
              <description>Read Not Write</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD</name>
              <description>Target Address</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>MTYPE</name>
              <description>Message Type</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MEND</name>
              <description>Message End</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR_ALT</name>
          <description>I3C Control register</description>
          <alternateRegister>CR</alternateRegister>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCNT</name>
              <description>Data Byte Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CCC</name>
              <description>8-Bit CCC code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MTYPE</name>
              <description>Message Type</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MEND</name>
              <description>Message End</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>I3C Controller Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Peripheral Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRINIT</name>
              <description>Peripheral Init mode (Target/Controller)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTROLLER</name>
                  <description>I3C Controller mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET</name>
                  <description>I3C Target (Controller capable) mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOARBH</name>
              <description>No Arbitration Header (7'h7E)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPTRN</name>
              <description>Reset Pattern enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXITPTRN</name>
              <description>Exit Pattern enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HKSDAEN</name>
              <description>High-Keeper on SDA Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HJACK</name>
              <description>Hot Join Acknowledgment</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>RX FIFO DMA mode Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFLUSH</name>
              <description>RX FIFO Flush</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXTHRES</name>
              <description>RX FIFO Threshold</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRESHOLD_1_4</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRESHOLD_4_4</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>TX FIFO DMA mode Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFLUSH</name>
              <description>TX FIFO Flush</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXTHRES</name>
              <description>TX FIFO Threshold</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRESHOLD_1_4</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRESHOLD_4_4</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMAEN</name>
              <description>Status FIFO DMA mode Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFLUSH</name>
              <description>Status FIFO Flush</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMODE</name>
              <description>Status FIFO mode Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMODE</name>
              <description>Control FIFO mode Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDMAEN</name>
              <description>Control FIFO DMA mode Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFLUSH</name>
              <description>Control FIFO Flush</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCFDIS</name>
              <description>FCF generation disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSFSET</name>
              <description>Transfer Set</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDR</name>
          <description>I3C Received Data register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDB0</name>
              <description>Receive Data Byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDWR</name>
          <description>I3C Received Data Word register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDB0</name>
              <description>Receive Data Byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RDB1</name>
              <description>Receive Data Byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RDBx</name>
              <description>Receive Data Byte, full double word</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <description>I3C Transmit Data register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TDB0</name>
              <description>Transmit Data Byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TDWR</name>
          <description>I3C Transmit Data Word register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TDB0</name>
              <description>Transmit Data Byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TDB1</name>
              <description>Transmit Data Byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TDBx</name>
              <description>Transmit Data Byte, full double word</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IBIDR</name>
          <description>I3C IBI payload Data register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IBIDB0</name>
              <description>IBI Data Byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IBIDB1</name>
              <description>IBI Data Byte 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IBIDBx</name>
              <description>IBI Data Byte, full double word</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TGTTDR</name>
          <description>I3C Target Transmit register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TGTTDCNT</name>
              <description>Target Transmit Data Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PRELOAD</name>
              <description>Transmit FIFO Preload Enable/Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>I3C Status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XDCNT</name>
              <description>Transfer Data Byte Count status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ABT</name>
              <description>Target Abort Indication</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>Message Direction</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write data or command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MID</name>
              <description>Message Identifier</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SER</name>
          <description>I3C Status Error register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CODERR</name>
              <description>Protocol Error Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTROLLER_ERROR_CE0</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTROLLER_ERROR_CE1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTROLLER_ERROR_CE2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTROLLER_ERROR_CE3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET_ERROR_TE0</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET_ERROR_TE1</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET_ERROR_TE2</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET_ERROR_TE3</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET_ERROR_TE4</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET_ERROR_TE5</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TARGET_ERROR_TE6</name>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERR</name>
              <description>Protocol Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>SCL Stall Error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOVR</name>
              <description>RX/TX FIFO Overrun</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COVR</name>
              <description>Status/Control FIFO Overrun</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANACK</name>
              <description>Address Not Acknowledged</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNACK</name>
              <description>Data Not Acknowledged</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DERR</name>
              <description>Data Error during the controller-role hand-off procedure</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RMR</name>
          <description>I3C Received Message register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IBIRDCNT</name>
              <description>Data Count when reading IBI data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RCODE</name>
              <description>CCC code of received command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RADD</name>
              <description>Target Address Received during accepted IBI or Controller-role request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
