modm-ext/data.modm.io/docs/svd/header_stm32h5e5xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART7</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x40007800</baseAddress>
      <interrupt>
        <name>UART7</name>
        <description>UART7 global interrupt</description>
        <value>98</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART8</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x40007c00</baseAddress>
      <interrupt>
        <name>UART8</name>
        <description>UART8 global interrupt</description>
        <value>99</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART9</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x40008000</baseAddress>
      <interrupt>
        <name>UART9</name>
        <description>UART9 global interrupt</description>
        <value>100</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART12</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x40008400</baseAddress>
      <interrupt>
        <name>UART12</name>
        <description>UART12 global interrupt</description>
        <value>101</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DTS</name>
      <description>DTS</description>
      <groupName>DTS</groupName>
      <baseAddress>0x40008c00</baseAddress>
      <interrupt>
        <name>DTS</name>
        <description>DTS global interrupt</description>
        <value>113</value>
      </interrupt>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>DTS configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_EN</name>
              <description>DTS Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_START</name>
              <description>Proceed to a frequency measurement on DTS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_INTRIG_SEL</name>
              <description>Input triggers selection bits [3:0] for DTS</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TS1_SMP_TIME</name>
              <description>Sample time [3:0] for DTS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REFCLK_SEL</name>
              <description>Reference Clock Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Q_MEAS_OPT</name>
              <description>Quick measure option bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSREF_CLK_DIV</name>
              <description>High Speed Clock Divider Ratio [6:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>T0VALR1</name>
          <description>DTS T0 Value register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_FMT0</name>
              <description>Engineering value of the measured frequency at T0 for DTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>TS1_T0</name>
              <description>Engineering value of the DTSerature T0 for DTS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPVALR</name>
          <description>DTS Ramp value register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_RAMP_COEFF</name>
              <description>Engineering value of the ramp coefficient for DTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITR1</name>
          <description>DTS Interrupt threshold register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_LITTHD</name>
              <description>Low interrupt threshold[15:0] for DTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>TS1_HITTHD</name>
              <description>High interrupt threshold[15:0] for DTS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>DTS data register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_MFREQ</name>
              <description>Measured Frequency[15:0] for DTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>DTS status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_ITEF</name>
              <description>Interrupt flag for end of measure for DTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITLF</name>
              <description>Interrupt flag for low threshold for DTS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITHF</name>
              <description>Interrupt flag for high threshold for DTS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITEF</name>
              <description>Asynchronous interrupt flag for end of measure for DTS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITLF</name>
              <description>Asynchronous interrupt flag for low threshold for DTS</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITHF</name>
              <description>Asynchronous interrupt flag for high threshold for DTS</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_RDY</name>
              <description>DTS ready flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ITENR</name>
          <description>DTS Interrupt enable register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_ITEEN</name>
              <description>Enable interrupt flag for end of measure for DTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITLEN</name>
              <description>Enable interrupt flag for low threshold for DTS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_ITHEN</name>
              <description>Enable interrupt flag for high threshold for DTS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITEEN</name>
              <description>Enable asynchronous interrupt flag for end of measure for DTS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITLEN</name>
              <description>Enable Asynchronous interrupt flag for low threshold for DTS</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_AITHEN</name>
              <description>Enable asynchronous interrupt flag for high threshold for DTS</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICIFR</name>
          <description>DTS Clear Interrupt flag register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS1_CITEF</name>
              <description>Clear the IT flag for End Of Measure for DTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CITLF</name>
              <description>Clear the IT flag for low threshold for DTS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CITHF</name>
              <description>Clear the IT flag for high threshold on DTS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CAITEF</name>
              <description>Clear the asynchronous IT flag for End Of Measure for DTS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CAITLF</name>
              <description>Clear the asynchronous IT flag for low threshold for DTS</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_CAITHF</name>
              <description>Clear the asynchronous IT flag for high threshold on DTS</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <description>DTS option register 1</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
