modm-ext/data.modm.io/docs/svd/header_stm32h5e5xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x44002800</baseAddress>
      <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 event interrupt</description>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 error interrupt</description>
        <value>81</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x44002c00</baseAddress>
      <interrupt>
        <name>I2C4_EV</name>
        <description>I2C4 event interrupt</description>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>I2C4_ER</name>
        <description>I2C4 error interrupt</description>
        <value>126</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I3C1">
      <name>I3C2</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <groupName>I3C</groupName>
      <baseAddress>0x44003000</baseAddress>
      <interrupt>
        <name>I3C2_EV</name>
        <description>I3C2 Event interrupt</description>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>I3C2_ER</name>
        <description>I3C2 Error interrupt</description>
        <value>132</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x44004400</baseAddress>
      <interrupt>
        <name>LPTIM1</name>
        <description>LPTIM1 global interrupt</description>
        <value>64</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM3</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x44004800</baseAddress>
      <interrupt>
        <name>LPTIM3</name>
        <description>LPTIM3 global interrupt</description>
        <value>127</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM4</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x44004c00</baseAddress>
      <interrupt>
        <name>LPTIM4</name>
        <description>LPTIM4 global interrupt</description>
        <value>128</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM5</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x44005000</baseAddress>
      <interrupt>
        <name>LPTIM5</name>
        <description>LPTIM5 global interrupt</description>
        <value>129</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM6</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x44005400</baseAddress>
      <interrupt>
        <name>LPTIM6</name>
        <description>LPTIM6 global interrupt</description>
        <value>130</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>VREFBUF</name>
      <description>VREFBUF</description>
      <groupName>VREFBUF</groupName>
      <baseAddress>0x44007400</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>VREFBUF control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENVR</name>
              <description>Voltage reference buffer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIZ</name>
              <description>High impedance mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VRR</name>
              <description>Voltage reference buffer ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VRS</name>
              <description>Voltage reference scale</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE0</name>
                  <description>Voltage reference scale 0 (VREF_OUT1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <description>Voltage reference scale 1 (VREF_OUT2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE2</name>
                  <description>Voltage reference scale 2 (VREF_OUT3)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE3</name>
                  <description>Voltage reference scale 3 (VREF_OUT4)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>VREFBUF calibration and control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRIM</name>
              <description>TRIM[5:0] bits (Trimming code)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
