modm-ext/data.modm.io/docs/svd/header_stm32h5e5xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI2</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x47002400</baseAddress>
      <interrupt>
        <name>OCTOSPI2</name>
        <description>OCTOSPI2 global interrupt</description>
        <value>150</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>OCTOSPIM</name>
      <description>Serial Peripheral Interface IO Manager</description>
      <groupName>XSPIM</groupName>
      <baseAddress>0x47003400</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>OCTOSPIM IO Manager Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>Multiplexed Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Multiplexing Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL_OVR_EN</name>
              <description>Chip Select Selector Override Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL_OVR_O1</name>
              <description>Chip Select Selector Override Setting For XSPI1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL_OVR_O2</name>
              <description>Chip Select Selector Override Setting For XSPI2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REQ2ACK_TIME</name>
              <description>REQ to ACK Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM2_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM3">
      <name>TIM3_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM3">
      <name>TIM4_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM5_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM6_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM12">
      <name>TIM12_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM13">
      <name>TIM13_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM13">
      <name>TIM14_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="WWDG">
      <name>WWDG_S</name>
      <description>WWDG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x50002c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="IWDG">
      <name>IWDG_S</name>
      <description>IWDG</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x50003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP1_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0x50003400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI2_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50003c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP12">
      <name>COMP12_S</name>
      <description>Comparator</description>
      <groupName>COMPOPT</groupName>
      <baseAddress>0x50004000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP1_S</name>
      <groupName>COMP</groupName>
      <baseAddress>0x5000400c</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2_S</name>
      <groupName>COMP</groupName>
      <baseAddress>0x50004010</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART2_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART3_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART4_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART5_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C1_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I3C1">
      <name>I3C1_S</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <groupName>I3C</groupName>
      <baseAddress>0x50005c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CRS">
      <name>CRS_S</name>
      <description>Clock Recovery System</description>
      <groupName>CRS</groupName>
      <baseAddress>0x50006000</baseAddress>
    </peripheral>
