modm-ext/data.modm.io/docs/svd/header_stm32h5e5xx.svd
    <peripheral derivedFrom="HASH">
      <name>HASH_S</name>
      <description>HASH</description>
      <groupName>HASH</groupName>
      <baseAddress>0x520c0400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RNG">
      <name>RNG_S</name>
      <description>RNG</description>
      <groupName>RNG</groupName>
      <baseAddress>0x520c0800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PKA">
      <name>PKA_S</name>
      <description>PKA</description>
      <groupName>PKA</groupName>
      <baseAddress>0x520c2000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SBS">
      <name>SBS_S</name>
      <description>System configuration, Boot and Security</description>
      <groupName>SBS</groupName>
      <baseAddress>0x54000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI5_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x54002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPUART1">
      <name>LPUART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x54002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x54002800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x54002c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I3C1">
      <name>I3C2_S</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <groupName>I3C</groupName>
      <baseAddress>0x54003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM3_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM4_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM5_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM6_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="VREFBUF">
      <name>VREFBUF_S</name>
      <description>VREFBUF</description>
      <groupName>VREFBUF</groupName>
      <baseAddress>0x54007400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RTC">
      <name>RTC_S</name>
      <description>Real-Time Clock</description>
      <groupName>RTC</groupName>
      <baseAddress>0x54007800</baseAddress>
      <interrupt>
        <name>RTC_S</name>
        <description>RTC secure interrupt</description>
        <value>3</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TAMP">
      <name>TAMP_S</name>
      <description>Tamper and backup registers</description>
      <groupName>TAMP</groupName>
      <baseAddress>0x54007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PLAY1">
      <name>PLAY1_S</name>
      <description>Programmable Logic Array (PLAY)</description>
      <groupName>PLAY</groupName>
      <baseAddress>0x54008000</baseAddress>
      <interrupt>
        <name>PLAY1_S</name>
        <description>PLAY1 global secure interrupt</description>
        <value>148</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PWR">
      <name>PWR_S</name>
      <description>Power Control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x54020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RCC">
      <name>RCC_S</name>
      <description>Reset and Clock Control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x54020c00</baseAddress>
      <interrupt>
        <name>RCC_S</name>
        <description>RCC secure global interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EXTI">
      <name>EXTI_S</name>
      <description>Asynch Interrupt/Event Controller (EXTI)</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x54022000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC1_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x56008000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x56008400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC2_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x56008800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC2_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x56008c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x5600f000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI2_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x5600f400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1_R">
      <name>FMC_Bank1_R_S</name>
      <description>Flexible Memory Controller</description>
      <groupName>FMC_Bank1</groupName>
      <baseAddress>0x57000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank3_R">
      <name>FMC_Bank3_R_S</name>
      <description>Flexible Memory Controller Bank3</description>
      <groupName>FMC_Bank3</groupName>
      <baseAddress>0x57000480</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1E_R">
      <name>FMC_Bank1E_R_S</name>
      <description>Flexible Memory Controller Bank1E</description>
      <groupName>FMC_Bank1E</groupName>
      <baseAddress>0x57000504</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank5_6_R">
      <name>FMC_Bank5_6_R_S</name>
      <description>Flexible Memory Controller Bank5 and 6</description>
      <groupName>FMC_Bank5_6</groupName>
      <baseAddress>0x57000540</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI1_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x57001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI2_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x57002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPIM">
      <name>OCTOSPIM_S</name>
      <description>Serial Peripheral Interface IO Manager</description>
      <groupName>XSPIM</groupName>
      <baseAddress>0x57003400</baseAddress>
    </peripheral>
  </peripherals>
</device>
